In [1]:
import pandas as pd

In [8]:
df = pd.read_csv('test.csv.txt')

In [9]:
df

  name  age      sal
0  abc   26  2000000
1  nik   30  2000000

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df['name']

0    abc
1    nik
Name: name, dtype: object

In [12]:
df['age']

0    26
1    30
Name: age, dtype: int64

In [14]:
df1 = pd.read_csv(r'C:\Users\Admin\Desktop\t.csv.txt')

In [15]:
df1

   id name    city
0   1  nik  sangli
1   2  pri     kok

In [19]:
df3 = pd.read_excel('ex.xlsx')

In [20]:
df3

     name
0  python

In [21]:
df3['price'] = 200

In [22]:
df3

     name  price
0  python    200

In [26]:
df3['name'] = 'cpp'

In [27]:
df3

  name  price
0  cpp    200

In [29]:
df3.to_html('ex.html')

In [30]:
df3

  name  price
0  cpp    200

In [31]:
py_dict = {
    'name' : ['a','b'],
    'id' : [2,3],
    'age' : [30,37]
    
}

In [32]:
df4 = pd.DataFrame(py_dict)

In [33]:
df4

  name  id  age
0    a   2   30
1    b   3   37

In [34]:
lt  = [(1,2,3,4),
       (20,30),
       ('a','b','c')
    
]

In [35]:
df7 = pd.DataFrame(lt)

In [36]:
df7

    0   1     2    3
0   1   2     3  4.0
1  20  30  None  NaN
2   a   b     c  NaN

In [37]:
df8 = pd.DataFrame(lt,columns=['a','b','c','d'])

In [38]:
df8

    a   b     c    d
0   1   2     3  4.0
1  20  30  None  NaN
2   a   b     c  NaN

In [43]:
df8.set_index('b')

     a     c    d
b
2    1     3  4.0
30  20  None  NaN
b    a     c  NaN

In [44]:
df7

    0   1     2    3
0   1   2     3  4.0
1  20  30  None  NaN
2   a   b     c  NaN

In [45]:
df7.shape

(3, 4)

In [46]:
row,col = df7.shape

In [47]:
row

3

In [48]:
col

4

In [50]:
df7.dtypes

0     object
1     object
2     object
3    float64
dtype: object

In [51]:
df7.describe()

         3
count  1.0
mean   4.0
std    NaN
min    4.0
25%    4.0
50%    4.0
75%    4.0
max    4.0

In [53]:
df7[2]

0       3
1    None
2       c
Name: 2, dtype: object

In [54]:
df7

    0   1     2    3
0   1   2     3  4.0
1  20  30  None  NaN
2   a   b     c  NaN

In [55]:
df7.2

SyntaxError: invalid syntax (2573557450.py, line 1)

In [56]:
df8

    a   b     c    d
0   1   2     3  4.0
1  20  30  None  NaN
2   a   b     c  NaN

In [57]:
df8.b

0     2
1    30
2     b
Name: b, dtype: object

In [58]:
new  = [(1,2,3,4),
       (20,30),
       ('a','b','c')
    
]

In [60]:
d = pd.DataFrame(new,columns=['a n','b','c','d'])

In [61]:
d

  a n   b     c    d
0   1   2     3  4.0
1  20  30  None  NaN
2   a   b     c  NaN

In [63]:
d.b

0     2
1    30
2     b
Name: b, dtype: object

In [64]:
d['a n']

0     1
1    20
2     a
Name: a n, dtype: object

In [65]:
=d['b']

0     2
1    30
2     b
Name: b, dtype: object

In [67]:
d[['b','c']]

    b     c
0   2     3
1  30  None
2   b     c

In [68]:
df

  name  age      sal
0  abc   26  2000000
1  nik   30  2000000

In [69]:
df.loc[0,:]

name        abc
age          26
sal     2000000
Name: 0, dtype: object

In [70]:
df.loc[0,"name":"age"]

name    abc
age      26
Name: 0, dtype: object

In [72]:
df.loc[0,["name","sal"]]

name        abc
sal     2000000
Name: 0, dtype: object

In [78]:
df.iloc[0:2,1:3]

   age      sal
0   26  2000000
1   30  2000000

In [79]:
##################practice
df = pd.DataFrame()

In [80]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [81]:
l= ['py','vy']
df1 = pd.DataFrame(l)

In [82]:
print(df1)

    0
0  py
1  vy